In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -2.559041  1.367454
1    a  two  0.790059  0.553983
2    b  one -1.430928  0.559243
3    b  two -1.260841  0.865694
4    a  one -0.540248  1.193507

In [2]:
grouped = df.groupby('key1')
grouped

In [4]:
grouped['data1'].sum()

key1
a   -2.309230
b   -2.691769
Name: data1, dtype: float64

In [10]:
grouped['data1'].agg(['sum','mean'])

           sum      mean
key1
a    -2.309230 -0.769743
b    -2.691769 -1.345884